//автоматический ночник

const int LED=11;   
const int LIGHT=A0;//датчик освещения - его не нужно задавать, он по дефолту как списывающий в темноте 200кОм 
//а при свете до 0
//пороги макс-мин датчика освещ
const int MIN_LIGHT=200; // максимальное - минимальное
const int MAX_LIGHT=600; 

void setup()
{
  pinMode(LED, OUTPUT); 
  pinMode(LIGHT, INPUT);
  Serial.begin(9600);
}

void loop()
{
  
  int val = analogRead(LIGHT); //будет от 0-1023
  Serial.println(val);
  //а передача в аналоговый от 0-255 для увелич-уменьш интенсивности светодиода
  val = map(val, MIN_LIGHT, MAX_LIGHT, 255, 0);  //функция переводит диапозон с 200-900 в 255-0 
  // т.е. при меньше свете напряжение меньше 200, н-р, и мы это значение переводим в 255 для мощности нашей лампочки
  val = constrain(val, 0, 255);  //ограничение границ (если больше 255 - то val = 255)                
  analogWrite(LED, val);                      
}


