
import cherrypy    # импорт кода модуля cherrypy в код проекта

class HelloWorld(object):      #
    @cherrypy.expose           # Предоставление доступа к функции обработки  запросов
    def index(self):           # Создание функции для обработки всех запросов
        return "Hello world!"  # Возвращаемое значение будет передаваться веб-браузеру

if __name__ == '__main__':
   cherrypy.quickstart(HelloWorld())    # запуск сервера CherryPy 
                                        # и передача указателя на 		   				# соответствующий экземпляр класса
                                        # для последующей обработки поступающих 					# запросов
